{"tools":[{"id":"110","name":"D3.js","summary":"D3.js is a JavaScript library for manipulating documents based on data. D3 helps you bring data to life using HTML, SVG and CSS. D3&rsquo;s emphasis on web standards gives you the full capabilities of modern browsers without tying yourself to a proprietary framework, combining powerful visualization components and a data-driven approach to DOM manipulation.","details":"D3.js is a JavaScript library for manipulating documents based on data. D3 helps you bring data to life using HTML, SVG and CSS. D3's emphasis on web standards gives you the full capabilities of modern browsers without tying yourself to a proprietary framework, combining powerful visualization components and a data-driven approach to DOM manipulation.","website":"http:\/\/d3js.org\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/blog\/d3-js-example.png","tags":"Hacker Storytelling,JavaScript,visualization"},{"id":"95","name":"Deck.js","summary":"Deck.js is the creation of Caleb Troughton, who developed the jQuery presentation framework over the course of several months during the fall of 2011. It is available as an open source GPL download with updates on GitHub. The framework&rsquo;s sole purpose is for building HTML presentations. Slides are basic HTML and include premade themes and templates to get you started with making a slide deck ","details":"Deck.js is the creation of Caleb Troughton, who developed the jQuery presentation framework over the course of several months during the fall of 2011. It is available as an open source GPL download with updates on GitHub. The framework&rsquo;s sole purpose is for building HTML presentations. Slides are basic HTML and include premade themes and templates to get you started with making a slide deck within minutes with little knowledge of HTML.","website":"http:\/\/imakewebthings.com\/deck.js\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/blog\/deck-js-logo.png","tags":"Hacker Storytelling,JavaScript,Presentations"},{"id":"94","name":"Github Gist","summary":"Gists are snippets of code. They can be entire applications, or they can just involve a single file. Best of all, every gist is a git repository, which means that they can be forked, cloned, and manipulated in every way.","details":"Gists are snippets of code. They can be entire applications, or they can just involve a single file. Best of all, every gist is a git repository, which means that they can be forked, cloned, and manipulated in every way.","website":"https:\/\/gist.github.com\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/blog\/github-gist-logo.png","tags":"API Management,Code,Code Management,Code Samples,Hacker Storytelling,JavaScript,Repositories"},{"id":"93","name":"Github Pages","summary":"GitHub Pages are public webpages freely hosted and easily published through our site. You can publish online using the Automatic Page Generator. If you prefer to work locally you can use the GitHub for Mac and Windows apps, or the command line.","details":"GitHub Pages are public webpages freely hosted and easily published through our site. You can publish online using the Automatic Page Generator. If you prefer to work locally you can use the GitHub for Mac and Windows apps, or the command line.","website":"http:\/\/pages.github.com\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/blog\/github-pages-logo.png","tags":"Hacker Storytelling,Hosting,Pages,Website"},{"id":"98","name":"Jekyll","summary":"Jekyll is a simple, blog-aware, static site generator. It takes a template directory containing raw text files in various formats, runs it through Markdown (or Textile) and Liquid converters, and spits out a complete, ready-to-publish static website suitable for serving with your favorite web server. Jekyll also happens to be the engine behind GitHub Pages, which means you can use Jekyll to host y","details":"Jekyll is a simple, blog-aware, static site generator. It takes a template directory containing raw text files in various formats, runs it through Markdown (or Textile) and Liquid converters, and spits out a complete, ready-to-publish static website suitable for serving with your favorite web server. Jekyll also happens to be the engine behind GitHub Pages, which means you can use Jekyll to host your project&rsquo;s page, blog, or website from GitHub&rsquo;s servers for free.","website":"http:\/\/jekyllrb.com\/docs\/home\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/blog\/jekyll-logo.png","tags":"API Management,Blog,GitHub,Github Pages,Hacker Storytelling,Pages,Ruby"},{"id":"100","name":"JSON Editor Online","summary":"JSON Editor Online is a web-based tool to view, edit, and format JSON. It has various modes such as a tree editor, a code editor, and a plain text editor. The editor can be used as a component in your own web application. The library can be loaded as CommonJS module, AMD module, or as a regular javascript file.","details":"JSON Editor Online is a web-based tool to view, edit, and format JSON. It has various modes such as a tree editor, a code editor, and a plain text editor. The editor can be used as a component in your own web application. The library can be loaded as CommonJS module, AMD module, or as a regular javascript file.","website":"http:\/\/www.jsoneditoronline.org\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/blog\/json-editor-online.png","tags":"Hacker Storytelling,JSON,JSON Editor"},{"id":"99","name":"Mustache","summary":"Mustache can be used for HTML, config files, source code - anything. It works by expanding tags in a template using values provided in a hash or object. We call it \"logic-less\" because there are no if statements, else clauses, or for loops. Instead there are only tags. Some tags are replaced with a value, some nothing, and others a series of values. This document explains the different types of Mu","details":"Mustache can be used for HTML, config files, source code - anything. It works by expanding tags in a template using values provided in a hash or object. We call it \"logic-less\" because there are no if statements, else clauses, or for loops. Instead there are only tags. Some tags are replaced with a value, some nothing, and others a series of values. This document explains the different types of Mustache tags.","website":"http:\/\/mustache.github.io\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/blog\/mustache-logo.png","tags":"Hacker Storytelling,JavaScript,JSON,Template"},{"id":"96","name":"Reveal.js","summary":"reveal.js is a framework for easily creating beautiful presentations using HTML. You'll need a browser with support for CSS 3D transforms to see it in its full glory.","details":"reveal.js is a framework for easily creating beautiful presentations using HTML. You'll need a browser with support for CSS 3D transforms to see it in its full glory.","website":"http:\/\/lab.hakim.se\/reveal-js\/","logo":"http:\/\/kinlane-productions.s3.amazonaws.com\/api-evangelist-site\/blog\/reveal-js-logo.png","tags":"Hacker Storytelling,JavaScript,Presentations"}],"published":"07\/17\/2013"}
